import json
import re

provinces = [
    ('北京', '市'),
    ('天津', '市'),
    ('河北', '省'),
    ('山西', '省'),
    ('内蒙古', '自治区'),
    ('辽宁', '省'),
    ('吉林', '省'),
    ('黑龙江', '省'),
    ('上海', '市'),
    ('江苏', '省'),
    ('浙江', '省'),
    ('安徽', '省'),
    ('福建', '省'),
    ('江西', '省'),
    ('山东', '省'),
    ('河南', '省'),
    ('湖北', '省'),
    ('湖南', '省'),
    ('广东', '省'),
    ('广西', '壮族自治区'),
    ('海南', '省'),
    ('重庆', '市'),
    ('四川', '省'),
    ('贵州', '省'),
    ('云南', '省'),
    ('西藏', '自治区'),
    ('陕西', '省'),
    ('甘肃', '省'),
    ('青海', '省'),
    ('宁夏', '回族自治区'),
    ('新疆', '维吾尔自治区'),
]

level2_suffixes = ['自治州', '地区', '新区', '市', '区', '州']

ethnics = [
    '蒙古', '回', '藏', '维吾尔', '苗', '彝', '壮', '布依', '朝鲜', '满', '侗', '瑶',
    '白', '土家', '哈尼', '哈萨克', '傣', '黎', '傈僳', '佤', '畲', '高山', '拉祜', '水',
     '东乡', '纳西', '景颇', '柯尔克孜', '土', '达斡尔', '仫佬', '羌', '布朗', '撒拉', '毛南',
      '仡佬', '锡伯', '阿昌', '普米', '塔吉克', '怒', '乌孜别克', '俄罗斯', '鄂温克', '德昂', 
      '保安', '裕固', '京', '塔塔尔', '独龙', '鄂伦春', '赫哲', '门巴', '珞巴', '基诺', '汉'
]

with open('cities.json') as f:
    data = json.load(f)

def parse(s):
    province = None
    for p in provinces:
        if s.startswith(''.join(p)):
            province = ''.join(p)
            s = s.removeprefix(province)
            break
        elif s.startswith(p[0]):
            province = ''.join(p)
            s = s.removeprefix(p[0])
            break
    return (province, s)
